JeongJiMin-github/OneModule-trunk/Hardware/HardwareDrv_M0516ldn.c
/**
********************************************************************************
* Copyright (c) 2016 CAS
* @brief   Hardware Driver Source File\n
           Chip : M0516LDN
* @file    HardwareDrv_M0516ldn.c
* @version 1.0
* @date    2016/12/06
* @author  Keum Young Kwang (KYK)
********************************************************************************
* @remark  [Version History]\n
*          v1.0 2016/12/06 created by KYK \n
********************************************************************************
*/

/*
********************************************************************************
*                       INCLUDES
********************************************************************************
*/
/* Insert include files here */
#include "M051Series.h"
#include "../Common/Globals.h"
#include "../DB/StorageDrv.h"
#include "HardwareConfig.h"

#ifdef CPU_M0516LDN
#include "clk.h"
#include "gpio.h"

/*
********************************************************************************
*                       GLOBAL(EXPORTED) VARIABLES & TABLES
********************************************************************************
*/
/* Insert global variables & tables here */
/** @brief I2C Port 중복 사용을 제한하기 위한 Flag */
INT8U I2cPortUseFlag;
/** @brief Key output port 상태, Display output port 와 공용 사용시 사용 */
INT8U  KeyOutputPortStatus;

 /*
********************************************************************************
*                       LOCAL DEFINITIONS & MACROS
********************************************************************************
*/
/* Insert #define here */
#define PLLCON_SETTING      CLK_PLLCON_50MHz_HXT
#define PLL_CLOCK           50000000

/*
********************************************************************************
*                       LOCAL DATA TYPES & STRUCTURES
********************************************************************************
*/
/* Insert local typedef & structure here */


/*
********************************************************************************
*                       GLOBAL(FILE SCOPE) VARIABLES & TABLES
********************************************************************************
*/
/* Insert file scope variable & tables here */


/*
********************************************************************************
*                       LOCAL FUNCTION PROTOTYPES
********************************************************************************
*/
/* Insert static function prototypes here */


/*
********************************************************************************
*                       GLOBAL(EXPORTED) FUNCTIONS
********************************************************************************
*/

/* Insert global functions here */

/**
********************************************************************************
* @brief    Hardware Dirver Init 함수\n
*           CPU Init\n
*           Hardware variable Init\n
* @param    none
* @return   none
* @remark   초기에 한번 실행 되는 함수\n
********************************************************************************
*/
void GpioInit(void)
{
	
	  #if (MODEL_NUM == MODEL_OMV4_PDN_LED)
        //ad
		GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);//AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);//AD_SDA

        //power
        GPIO_SetMode(P3, BIT4, GPIO_PMD_OUTPUT);	//POWER_CON //
        
        //key
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);		//TARE
        GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);		//MODE
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);		//ZERO
        GPIO_SetMode(P0, BIT3, GPIO_PMD_QUASI);		//SW_CAL

        //lcd
		GPIO_SetMode(P0, BIT2, GPIO_PMD_OUTPUT);	//DISP_SDA
        GPIO_SetMode(P0, BIT1, GPIO_PMD_OUTPUT);	//DISP_SCL

        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);	//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);		//EEPROM_SDA
		
		//temperature
#ifdef TEMP_DRV_NTC10K
		GPIO_SetMode(P1, BIT6, GPIO_PMD_INPUT);		//NTC Temperature sensor
#endif
        //etc
        GPIO_SetMode(P2, BIT4, GPIO_PMD_OUTPUT);	//BUZZER

		BUZZER_CLR;
        GPIO_DISABLE_DIGITAL_PATH(P0, 0x01);
    #endif

    #if (MODEL_NUM == MODEL_OMV4_SW1SCU_LCD) || (MODEL_NUM == MODEL_OMV4_SW1SU_LCD_ECR)
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);//AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);//AD_SDA
        
        //key
        GPIO_SetMode(P2, BIT0, GPIO_PMD_QUASI);//POWER_KEY_CHK
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//ZERO
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//TARE
        GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);//HOLD or MODE

        //lcd
        GPIO_SetMode(P0, BIT0, GPIO_PMD_QUASI);//LCD_CS
        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);//LCD_WR
        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);//LCD_DATA

        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA

        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA

        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT4, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P2, BIT3, GPIO_PMD_QUASI);//POWER_CON
               
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);
        
    #endif
        
#if MODEL_NUM == MODEL_OMV4_SW2W_LCD
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);//AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);//AD_SDA
        
        //ad check
        GPIO_SetMode(P2, BIT7, GPIO_PMD_INPUT);//ad check
        
        //key
        GPIO_SetMode(P2, BIT0, GPIO_PMD_QUASI);//POWER_KEY_CHK
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//ZERO
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//TARE
        GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);//HOLD or MODE

        //lcd
        GPIO_SetMode(P0, BIT0, GPIO_PMD_QUASI);//LCD_CS
        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);//LCD_WR
        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);//LCD_DATA
        
        GPIO_SetMode(P3, BIT5, GPIO_PMD_OUTPUT);//BACKLIGHT

        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA

        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA

        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT4, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P2, BIT3, GPIO_PMD_QUASI);//POWER_CON
        
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);
        
    #endif
        
    #if MODEL_NUM == MODEL_OMV4_SWLRWR_LED
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);//AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);//AD_SDA

        //key
        GPIO_SetMode(P1, BIT6, GPIO_PMD_QUASI);//POWER_KEY_CHK
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//ZERO
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//TARE
        GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);//HOLD or MODE

        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA

        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA

        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT4, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);//POWER_CON
        
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);
    #endif

    #if MODEL_NUM ==(MODEL_NUM == MODEL_OMV4_SW2W_LED)
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);//AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);//AD_SDA
        
        //ad check
        GPIO_SetMode(P2, BIT7, GPIO_PMD_INPUT);//ad check
        
        //key
        GPIO_SetMode(P1, BIT6, GPIO_PMD_QUASI);//POWER_KEY_CHK
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//ZERO
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//TARE
        GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);//HOLD or MODE
        
        //led
        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);//CS5817_CLK
        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);//CS5817_SDA

        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA

        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA

        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT4, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);//POWER_CON
        
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);
    #endif
        
