JeongJiMin-github/OneModule-trunk/Hardware/HardwareDrv_M0516ldn.c
    #if MODEL_NUM == MODEL_OMV4_DB2_LCD

        //ADC
		GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);
		GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);

		//Buzzer
		GPIO_SetMode(P2, BIT3, GPIO_PMD_OUTPUT);

		//Power Con
		GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);

		//Key
		GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);		//SW_CAL
		GPIO_SetMode(P1, BIT6, GPIO_PMD_QUASI);		//POWER_KEY_CHK
		GPIO_SetMode(P3, BIT2, GPIO_PMD_QUASI);		//KEY_PORT_PRINT
		GPIO_SetMode(P3, BIT3, GPIO_PMD_QUASI);		//KEY_PORT_HOLD
		GPIO_SetMode(P3, BIT4, GPIO_PMD_QUASI);		//KEY_PORT_SAMPLE
		GPIO_SetMode(P3, BIT5, GPIO_PMD_QUASI);		//KEY_PORT_SET
		GPIO_SetMode(P3, BIT6, GPIO_PMD_QUASI);		//KEY_PORT_MODE
		GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);		//KEY_PORT_TARE
		GPIO_SetMode(P2, BIT0, GPIO_PMD_QUASI);		//KEY_PORT_ZERO

		//LCD
		GPIO_SetMode(P0, BIT0, GPIO_PMD_OUTPUT);	//HT1621_CS
		GPIO_SetMode(P0, BIT2, GPIO_PMD_OUTPUT);	//HT1621_WR
		GPIO_SetMode(P0, BIT1, GPIO_PMD_OUTPUT);	//HT1621_DATA
		GPIO_SetMode(P2, BIT4, GPIO_PMD_OUTPUT);	//BACK_LIGHT

		//EEPROM
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);	//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);		//EEPROM_SDA

        //RTC
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);	//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);		//RTC_SDA

		//Bat check
		//GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);		//BAT_CHK
		//GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);

    #endif

    #if MODEL_NUM == MODEL_OMV4_DB2_LED_5DIGIT
        //ADC
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);
        
        //Buzzer
        GPIO_SetMode(P2, BIT4, GPIO_PMD_OUTPUT);
        
        //Power Con
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);
        
        //Key
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);		//SW_CAL
		GPIO_SetMode(P1, BIT6, GPIO_PMD_QUASI);		//POWER_KEY_CHK
		GPIO_SetMode(P3, BIT2, GPIO_PMD_QUASI);		//KEY_PORT_PRINT
		GPIO_SetMode(P3, BIT3, GPIO_PMD_QUASI);		//KEY_PORT_HOLD
		GPIO_SetMode(P3, BIT4, GPIO_PMD_QUASI);		//KEY_PORT_SAMPLE
		GPIO_SetMode(P3, BIT5, GPIO_PMD_QUASI);		//KEY_PORT_SET	
		GPIO_SetMode(P3, BIT6, GPIO_PMD_QUASI);		//KEY_PORT_MODE
		GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);		//KEY_PORT_TARE
		GPIO_SetMode(P2, BIT0, GPIO_PMD_QUASI);		//KEY_PORT_ZERO
        
        //EEPROM
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);	//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);		//EEPROM_SDA

        //RTC
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);	//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);		//RTC_SDA

        GPIO_SetMode(P0, BIT0, GPIO_PMD_OUTPUT);    //LED_INDICATOR
        GPIO_SetMode(P0, BIT1, GPIO_PMD_OUTPUT);    //LED_DIGIT_1
        GPIO_SetMode(P0, BIT2, GPIO_PMD_OUTPUT);    //LED_DIGIT_2
        GPIO_SetMode(P0, BIT3, GPIO_PMD_OUTPUT);    //LED_DIGIT_3
        GPIO_SetMode(P0, BIT4, GPIO_PMD_OUTPUT);    //LED_DIGIT_4
        GPIO_SetMode(P0, BIT5, GPIO_PMD_OUTPUT);    //LED_DIGIT_5
        GPIO_SetMode(P0, BIT6, GPIO_PMD_OUTPUT);    //LED_DIGIT_6
        GPIO_SetMode(P2, BIT1, GPIO_PMD_OUTPUT);    //COM_CON
        GPIO_SetMode(P2, BIT2, GPIO_PMD_OUTPUT);    //DIGIT_CON
    #endif
		
	#if MODEL_NUM == MODEL_OMV4_DB1H_VFD
        //ADC
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);
		
		//POWER CON
		GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);	//POWER_CON
		
		//KEY
		GPIO_SetMode(P3, BIT2, GPIO_PMD_QUASI);		//KEY_PORT_ZERO
		GPIO_SetMode(P3, BIT3, GPIO_PMD_QUASI);		//KEY_PORT_TARE
		GPIO_SetMode(P3, BIT4, GPIO_PMD_QUASI);		//KEY_PORT_HOLD
		GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);		//SW_CAL
		GPIO_SetMode(P1, BIT6, GPIO_PMD_INPUT);		//POWER_KEY_CHK
		
		//BUZZER
		GPIO_SetMode(P3, BIT5, GPIO_PMD_OUTPUT);	//BUZZER

		//EEPROM
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);	//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);		//EEPROM_SDA
		
		//VFD
		GPIO_SetMode(P2, BIT1, GPIO_PMD_OUTPUT);	//PT6311_STROBE
        GPIO_SetMode(P2, BIT2, GPIO_PMD_OUTPUT);	//PT6311_DATA
		GPIO_SetMode(P2, BIT3, GPIO_PMD_OUTPUT);	//PT6311_CLK
				
		//RS232
        GPIO_SetMode(P1, BIT6, GPIO_PMD_QUASI);
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);

		//RTC
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);	//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);		//RTC_SDA
		
    #endif  
        
    #if (MODEL_NUM == MODEL_OMV4_ER_LCD) || (MODEL_NUM == MODEL_OMV4_ER_LCD_ECR) || (MODEL_NUM == MODEL_OMV4_ER_LCD_CLERK) ||  (MODEL_NUM == MODEL_OMV4_ER_LCD_SATO)
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);    //AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);     //AD_SDA

        //key
        GPIO_SetMode(P3, BIT2, GPIO_PMD_QUASI);     //Key_IN_1
        GPIO_SetMode(P3, BIT3, GPIO_PMD_QUASI);     //Key_IN_2
        GPIO_SetMode(P3, BIT4, GPIO_PMD_QUASI);     //Key_IN_3
        GPIO_SetMode(P3, BIT5, GPIO_PMD_QUASI);     //Key_IN_4

        
        GPIO_SetMode(P0, BIT0, GPIO_PMD_QUASI);     //Key_OUT_1
        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);     //Key_OUT_2
        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);     //Key_OUT_3
        GPIO_SetMode(P0, BIT3, GPIO_PMD_QUASI);     //Key_OUT_4
        GPIO_SetMode(P0, BIT4, GPIO_PMD_QUASI);     //Key_OUT_5
        GPIO_SetMode(P0, BIT5, GPIO_PMD_QUASI);     //Key_OUT_6

        
        GPIO_SetMode(P1, BIT6, GPIO_PMD_INPUT);	    //POWER_KEY_CHK
        
        //Power Con
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);
        
        //lcd
        GPIO_SetMode(P2, BIT0, GPIO_PMD_QUASI);//LCD_CS
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//LCD_WR
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//LCD_DATA
        GPIO_SetMode(P2, BIT4, GPIO_PMD_QUASI);//BACK_LIGHT

        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA

        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA

        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT3, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);//POWER_CON
        
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);
    #endif
        
    #if MODEL_NUM == MODEL_OMV4_ER_LED   
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);    //AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);     //AD_SDA

        //key
        GPIO_SetMode(P3, BIT4, GPIO_PMD_QUASI);     //Key_IN_1
        GPIO_SetMode(P3, BIT5, GPIO_PMD_QUASI);     //Key_IN_2
        GPIO_SetMode(P3, BIT6, GPIO_PMD_QUASI);     //Key_IN_3
        GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);     //Key_IN_4
        
        GPIO_SetMode(P1, BIT6, GPIO_PMD_INPUT);	    //POWER_KEY_CHK
        
        //led     
        GPIO_SetMode(P3, BIT2, GPIO_PMD_QUASI);    //LED_SEG_LATCH
        GPIO_SetMode(P3, BIT3, GPIO_PMD_QUASI);    //LED_SEG_OUT_ENABLE
        GPIO_SetMode(P2, BIT0, GPIO_PMD_QUASI);    //LED Digit1~8 Latch
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);    //LED Digit9~16 Latch
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);    //LED Digit17~20 Latch
        GPIO_SetMode(P2, BIT3, GPIO_PMD_QUASI);    //LED Digit Output Enable
        
        //key scan
        GPIO_SetMode(P0, BIT0, GPIO_PMD_QUASI);
        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);
        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);
        GPIO_SetMode(P0, BIT3, GPIO_PMD_QUASI);
        GPIO_SetMode(P0, BIT4, GPIO_PMD_QUASI);
        GPIO_SetMode(P0, BIT5, GPIO_PMD_QUASI);
        GPIO_SetMode(P0, BIT6, GPIO_PMD_QUASI);
        GPIO_SetMode(P0, BIT7, GPIO_PMD_QUASI);
        
        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA

        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA

        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT4, GPIO_PMD_QUASI);//BUZZER
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);//POWER_CON
        
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);
    #endif
        
