JeongJiMin-github/OneModule-trunk/Hardware/HardwareDrv_M0516ldn.c
    #if (MODEL_NUM == MODEL_OMV4_ER_PRO_LCD) || (MODEL_NUM == MODEL_OMV4_ER_PRO_LCD_ECR)
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);    //AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);     //AD_SDA
        
        //key
        GPIO_SetMode(P3, BIT2, GPIO_PMD_INPUT);     //Key_IN_1
        GPIO_SetMode(P3, BIT3, GPIO_PMD_INPUT);     //Key_IN_2
        GPIO_SetMode(P3, BIT4, GPIO_PMD_INPUT);     //Key_IN_3
        GPIO_SetMode(P3, BIT5, GPIO_PMD_INPUT);     //Key_IN_4
        GPIO_SetMode(P3, BIT6, GPIO_PMD_INPUT);     //Key_IN_5
        GPIO_SetMode(P3, BIT7, GPIO_PMD_INPUT);     //Key_IN_5
        GPIO_SetMode(P2, BIT0, GPIO_PMD_INPUT);     //Key_IN_6
        GPIO_SetMode(P0, BIT7, GPIO_PMD_INPUT);     //Key_IN_7
        
//        GPIO_SetMode(P0, BIT0, GPIO_PMD_QUASI);     //Key_OUT_1
//        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);     //Key_OUT_2
//        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);     //Key_OUT_3
        
        GPIO_SetMode(P0, BIT0, GPIO_PMD_OUTPUT);     //Key_OUT_1
        GPIO_SetMode(P0, BIT1, GPIO_PMD_OUTPUT);     //Key_OUT_2
        GPIO_SetMode(P0, BIT2, GPIO_PMD_OUTPUT);     //Key_OUT_3
        
        
        GPIO_SetMode(P1, BIT6, GPIO_PMD_QUASI);	    //POWER_KEY_CHK
        
        //Power Con
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);
        
        //lcd
        GPIO_SetMode(P2, BIT3, GPIO_PMD_QUASI);//LCD_CS
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//LCD_WR
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//LCD_DATA
        GPIO_SetMode(P2, BIT4, GPIO_PMD_QUASI);//BACK_LIGHT
        
        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA
        
        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA
        
        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT3, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);//POWER_CON
        
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);

    #endif

    #if MODEL_NUM == MODEL_OMV4_ER_PRO_LED
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);    //AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);     //AD_SDA
        
        //key
        GPIO_SetMode(P3, BIT2, GPIO_PMD_INPUT);     //Key_IN_1
        GPIO_SetMode(P3, BIT3, GPIO_PMD_INPUT);     //Key_IN_2
        GPIO_SetMode(P3, BIT4, GPIO_PMD_INPUT);     //Key_IN_3
        GPIO_SetMode(P3, BIT5, GPIO_PMD_INPUT);     //Key_IN_4
        GPIO_SetMode(P3, BIT6, GPIO_PMD_INPUT);     //Key_IN_5
        GPIO_SetMode(P3, BIT7, GPIO_PMD_INPUT);     //Key_IN_5
        GPIO_SetMode(P2, BIT0, GPIO_PMD_INPUT);     //Key_IN_6
        GPIO_SetMode(P0, BIT7, GPIO_PMD_INPUT);     //Key_IN_7
        
        GPIO_SetMode(P0, BIT0, GPIO_PMD_QUASI);     //Key_OUT_1
        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);     //Key_OUT_2
        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);     //Key_OUT_3

        GPIO_SetMode(P1, BIT6, GPIO_PMD_QUASI);	    //POWER_KEY_CHK
        
        //Power Con
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);
        
        //lcd
        GPIO_SetMode(P2, BIT3, GPIO_PMD_QUASI);//LCD_CS
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//LCD_WR
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//LCD_DATA
        GPIO_SetMode(P2, BIT4, GPIO_PMD_QUASI);//BACK_LIGHT
        
        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA
        
        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA
        
        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
//        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT3, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);//POWER_CON
        
//        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);

    #endif

        
    #if MODEL_NUM == MODEL_OMV4_ED_LCD    
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);    //AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);     //AD_SDA
        
        //key
        GPIO_SetMode(P3, BIT5, GPIO_PMD_QUASI);     //KEY_PORT_POS0
        GPIO_SetMode(P3, BIT4, GPIO_PMD_QUASI);     //KEY_PORT_POS1
        GPIO_SetMode(P3, BIT2, GPIO_PMD_QUASI);     //KEY_PORT_POS2
        GPIO_SetMode(P3, BIT6, GPIO_PMD_QUASI);     //KEY_PORT_POS3
        GPIO_SetMode(P3, BIT3, GPIO_PMD_QUASI);     //KEY_PORT_POS4
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);     //KEY_PORT_POS5
        GPIO_SetMode(P2, BIT0, GPIO_PMD_QUASI);     //KEY_PORT_POS6
        GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);     //KEY_PORT_POS7
        
        GPIO_SetMode(P1, BIT6, GPIO_PMD_QUASI);	    //POWER_KEY_CHK
       
        //lcd
        GPIO_SetMode(P0, BIT0, GPIO_PMD_QUASI);//LCD_CS
        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);//LCD_WR
        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);//LCD_DATA
        GPIO_SetMode(P2, BIT4, GPIO_PMD_QUASI);//BACK_LIGHT
        
        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA
        
        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA
        
        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT3, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P1, BIT7, GPIO_PMD_QUASI);//POWER_CON
        
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);

    #endif
        
    #if (MODEL_NUM == MODEL_OMV4_ER2_LCD) || (MODEL_NUM == MODEL_OMV4_ER2_LCD_ECR) || (MODEL_NUM == MODEL_OMV4_ER2_LCD_SATO)
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);    //AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);     //AD_SDA
        
        //key
        GPIO_SetMode(P3, BIT2, GPIO_PMD_QUASI);     //Key_IN_1
        GPIO_SetMode(P3, BIT3, GPIO_PMD_QUASI);     //Key_IN_2
        GPIO_SetMode(P3, BIT4, GPIO_PMD_QUASI);     //Key_IN_3
        GPIO_SetMode(P3, BIT5, GPIO_PMD_QUASI);     //Key_IN_4

        
        GPIO_SetMode(P0, BIT0, GPIO_PMD_QUASI);     //Key_OUT_1
        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);     //Key_OUT_2
        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);     //Key_OUT_3
        GPIO_SetMode(P0, BIT3, GPIO_PMD_QUASI);     //Key_OUT_4
        GPIO_SetMode(P0, BIT4, GPIO_PMD_QUASI);     //Key_OUT_5
       
        //lcd
        GPIO_SetMode(P2, BIT0, GPIO_PMD_QUASI);//LCD_CS
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//LCD_WR
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//LCD_DATA
        GPIO_SetMode(P2, BIT4, GPIO_PMD_QUASI);//BACK_LIGHT
        
        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA
        
        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA
        
        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT3, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);//POWER_CON
        
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);

    #endif
        
    #if MODEL_NUM == MODEL_OMV4_EB_LCD   
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);    //AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);     //AD_SDA

        //key
        GPIO_SetMode(P3, BIT2, GPIO_PMD_QUASI);     //Key_IN_1
        GPIO_SetMode(P3, BIT3, GPIO_PMD_QUASI);     //Key_IN_2
        GPIO_SetMode(P3, BIT4, GPIO_PMD_QUASI);     //Key_IN_3
        GPIO_SetMode(P3, BIT5, GPIO_PMD_QUASI);     //Key_IN_4

        
        GPIO_SetMode(P0, BIT0, GPIO_PMD_QUASI);     //Key_OUT_1
        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);     //Key_OUT_2
        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);     //Key_OUT_3
        GPIO_SetMode(P0, BIT3, GPIO_PMD_QUASI);     //Key_OUT_4
        GPIO_SetMode(P0, BIT4, GPIO_PMD_QUASI);     //Key_OUT_5
        GPIO_SetMode(P0, BIT5, GPIO_PMD_QUASI);     //Key_OUT_6

        
        GPIO_SetMode(P1, BIT6, GPIO_PMD_INPUT);	    //POWER_KEY_CHK
        
        //Power Con
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);
        
        //lcd
        GPIO_SetMode(P2, BIT0, GPIO_PMD_QUASI);//LCD_DATA
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//LCD_WR
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//LCD_CS
        GPIO_SetMode(P2, BIT4, GPIO_PMD_QUASI);//BACK_LIGHT

        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA

        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA

        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT3, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P1, BIT7, GPIO_PMD_OUTPUT);//POWER_CON
        
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);
    #endif
        
    #if MODEL_NUM == MODEL_OMV4_PW2_LCD
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);//AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);//AD_SDA
        
        //key
        GPIO_SetMode(P2, BIT0, GPIO_PMD_QUASI);//POWER
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//ZERO
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//TARE
        GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);//HOLD or MODE
        
        //lcd
        GPIO_SetMode(P3, BIT2, GPIO_PMD_QUASI);//LCD_CS
        GPIO_SetMode(P3, BIT3, GPIO_PMD_QUASI);//LCD_WR
        GPIO_SetMode(P3, BIT4, GPIO_PMD_QUASI);//LCD_DATA
        
        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA
        
        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA
        
        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        GPIO_SetMode(P2, BIT3, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P1, BIT1, GPIO_PMD_OUTPUT);//POWER_CON
    #endif
        
    #if  MODEL_NUM == MODEL_NUM_MODEL_OMV4_PB_LCD
        //ad
        GPIO_SetMode(P1, BIT4, GPIO_PMD_OUTPUT);//AD_SCL
        GPIO_SetMode(P4, BIT2, GPIO_PMD_QUASI);//AD_SDA

        //key
        GPIO_SetMode(P2, BIT0, GPIO_PMD_INPUT);//POWER_KEY_CHK
        GPIO_SetMode(P2, BIT2, GPIO_PMD_QUASI);//ZERO
        GPIO_SetMode(P2, BIT1, GPIO_PMD_QUASI);//TARE
        GPIO_SetMode(P3, BIT7, GPIO_PMD_QUASI);//HOLD or MODE

        //lcd
        GPIO_SetMode(P0, BIT0, GPIO_PMD_QUASI);//LCD_CS
        GPIO_SetMode(P0, BIT1, GPIO_PMD_QUASI);//LCD_WR
        GPIO_SetMode(P0, BIT2, GPIO_PMD_QUASI);//LCD_DATA
        //Backlight
        GPIO_SetMode(P3, BIT6, GPIO_PMD_QUASI);//LCD_CS
        //eeprom
        GPIO_SetMode(P4, BIT4, GPIO_PMD_OUTPUT);//EEPROM_SCL
        GPIO_SetMode(P4, BIT5, GPIO_PMD_QUASI);//EEPROM_SDA

        //rtc
        GPIO_SetMode(P2, BIT5, GPIO_PMD_OUTPUT);//RTC_SCL
        GPIO_SetMode(P2, BIT6, GPIO_PMD_QUASI);//RTC_SDA

        //etc
        GPIO_SetMode(P1, BIT0, GPIO_PMD_INPUT);//SW_CAL
        GPIO_SetMode(P1, BIT5, GPIO_PMD_INPUT);//BAT_CHK
        
        GPIO_SetMode(P1, BIT6, GPIO_PMD_INPUT);//DRY BAT_CHK
        
