JeongJiMin-github/OneModule-trunk/Hardware/HardwareDrv_M0516ldn.c
        GPIO_SetMode(P2, BIT4, GPIO_PMD_OUTPUT);//BUZZER
        GPIO_SetMode(P2, BIT3, GPIO_PMD_QUASI);//POWER_CON
        
        GPIO_DISABLE_DIGITAL_PATH(P1, 0x20);
        
    #endif
} 
void SYS_Init(void)
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Enable IRC22M clock */
    CLK->PWRCON |= CLK_PWRCON_IRC22M_EN_Msk;

    /* Waiting for IRC22M clock ready */
    CLK_WaitClockReady(CLK_CLKSTATUS_IRC22M_STB_Msk);

    /* Switch HCLK clock source to HIRC */
    CLK->CLKSEL0 = CLK_CLKSEL0_HCLK_S_HIRC;

//    /* Enable external 12 MHz XTAL, IRC10K */
//    CLK->PWRCON |= CLK_PWRCON_XTL12M_EN_Msk | CLK_PWRCON_OSC10K_EN_Msk;

//    /* Waiting for clock ready */
//    CLK_WaitClockReady(CLK_CLKSTATUS_PLL_STB_Msk | CLK_CLKSTATUS_XTL12M_STB_Msk | CLK_CLKSTATUS_IRC10K_STB_Msk);

    /* Enable peripheral clock */
    CLK->APBCLK = CLK_APBCLK_UART0_EN_Msk | CLK_APBCLK_UART1_EN_Msk|
                  CLK_APBCLK_ADC_EN_Msk |
                  CLK_APBCLK_TMR0_EN_Msk | CLK_APBCLK_TMR1_EN_Msk | CLK_APBCLK_TMR2_EN_Msk | CLK_APBCLK_TMR3_EN_Msk;

    /* Peripheral clock source */
    CLK->CLKSEL1 = CLK_CLKSEL1_UART_S_HIRC |
                   CLK_CLKSEL1_ADC_S_HIRC |
                   CLK_CLKSEL1_TMR0_S_HIRC | CLK_CLKSEL1_TMR1_S_HIRC | CLK_CLKSEL1_TMR2_S_HIRC | CLK_CLKSEL1_TMR3_S_HIRC;

    /* Update System Core Clock */
#ifdef USE_BACK_LIGHT
    //for debugging backlight flicker
    //22.1184MHz/4 = 5.52 MHz
    CLK_SetHCLK(CLK_CLKSEL0_HCLK_S_HIRC, CLK_CLKDIV_HCLK(4));
#else
    //22.1184MHz/8 = 2.76 MHz
    CLK_SetHCLK(CLK_CLKSEL0_HCLK_S_HIRC, CLK_CLKDIV_HCLK(8));
#endif

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/

    /* Set P3 multi-function pins for UART0 RXD and TXD */
    SYS->P3_MFP &= ~(SYS_MFP_P30_Msk | SYS_MFP_P31_Msk);
    SYS->P3_MFP |= (SYS_MFP_P30_RXD0 | SYS_MFP_P31_TXD0);

    /* Set P1 multi-function pins for UART1 RXD and TXD */
    SYS->P1_MFP &= ~(SYS_MFP_P12_Msk | SYS_MFP_P13_Msk);
    SYS->P1_MFP |= (SYS_MFP_P12_RXD1 | SYS_MFP_P13_TXD1);

    /* Set P1 multi-function pins for AN5 (BAT_CHK) */
    SYS->P1_MFP &= ~SYS_MFP_P15_Msk;
    SYS->P1_MFP |= SYS_MFP_P15_AIN5;
#ifdef TEMP_DRV_NTC10K	
	/* Set P1 multi-function pins for AN4 (Thermisotor) */
	SYS->P1_MFP &= ~SYS_MFP_P16_Msk;
	SYS->P1_MFP |= SYS_MFP_P16_AIN6;
#endif
}

void HwDrvInit(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, IP clock and multi-function I/O */
    SYS_Init();
    GpioInit();
    
#ifdef USE_DISABLE_LVR  //for emc debugging
    /* This macro disable Low-Voltage-Reset function. */
    SYS_DISABLE_LVR();
#endif
    /* Lock protected registers */
    SYS_LockReg();
    
    I2cPortUseFlag = OFF;
}

/**
********************************************************************************
* @brief    다음에 켤 때 Factory Boot가 무조건 실행하도록 하는 함수\n
* @param    none
* @return   none
* @remark   ENBOOT = 1, BSB = 0xFF, SBV = 0xFC 로 만든다.\n
********************************************************************************
*/
void HwDrvSetFactoryBoot(void)
{

}

/*
********************************************************************************
*                       LOCAL FUNCTIONS
********************************************************************************
*/
/* Insert local functions here */

#endif //#ifdef CPU_M0516LDN
